# UpdaterId Class

---
A unique identifier of an Updater
SystemObject Autodesk.Revit.DBUpdaterId
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class UpdaterId : IDisposable

    Public Class UpdaterId
    	Implements IDisposable

    public ref class UpdaterId : IDisposable

    type UpdaterId =
        class
            interface IDisposable
        end
The UpdaterId type exposes the following members.
| Name| Description
---|---|---
| UpdaterId|  creates an instance of UpdaterId for given AddInId and a given GUID value
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the UpdaterId
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetAddInId|  AddInId of the UpdaterId
| GetGUID|  GUID value of the UpdaterId
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
UpdaterID used as a key to register and unregister Updaters and UpdateTriggers in Revit application
#### Reference
Autodesk.Revit.DB Namespace